[
  {
    "name": "Luke Skywalker",
    "description": "Luke Skywalker is a fictional character and the main protagonist of the original film trilogy of the Star Wars franchise created by George Lucas. The character, portrayed by Mark Hamill, is an important figure in the Rebel Alliance's struggle against the Galactic Empire. He is the twin brother of Rebellion leader Princess Leia Organa of Alderaan, a friend and brother-in-law of smuggler Han Solo, an apprentice to Jedi Masters Obi-Wan \"Ben\" Kenobi and Yoda, the son of fallen Jedi Anakin Skywalker (Darth Vader) and Queen of Naboo/Republic Senator Padmé Amidala and maternal uncle of Kylo Ren / Ben Solo. The now non-canon Star Wars expanded universe depicts him as a powerful Jedi Master, husband of Mara Jade, the father of Ben Skywalker and maternal uncle of Jaina, Jacen and Anakin Solo.",
    "portraitID": "Luke"

  },
  {
    "name": "Han Solo",
    "description": "Han Solo is a character in the Star Wars franchise. In the original film trilogy, Han and his co-pilot, Chewbacca, become involved in the Rebel Alliance's struggle against the Galactic Empire. During the course of the Star Wars story, he becomes a chief figure in the Alliance and succeeding galactic governments. Star Wars creator George Lucas described the character as a loner who realizes the importance of being part of a group and helping for the common good. Harrison Ford portrayed the character in the original Star Wars trilogy and Star Wars: The Force Awakens, and Alden Ehrenreich will portray a young Han Solo in an upcoming, as yet untitled spinoff film.",
    "portraitID": "Han"
  },
  {
    "name": "BB8",
    "description": "BB-8 (or Beebee-Ate) is a droid character in the Star Wars franchise, first appearing in the 2015 film Star Wars: The Force Awakens. Spherical with a free-moving domed head, BB-8 is portrayed by both a rod puppet and a remote-controlled robotic unit.",
    "portraitID": "BB8"
  },
  {
    "name": "Darth Vader",
    "description": "Darth Vader, also known by his birth name Anakin Skywalker, is a fictional character in the Star Wars franchise. Vader appears in the original film trilogy as a pivotal antagonist whose actions drive the plot, while his past as Anakin Skywalker and the story of his corruption are central to narrative of the prequel trilogy. The character was created by George Lucas and has been portrayed by numerous actors. His appearances span the first six Star Wars films, as well as Rogue One, and his character is heavily referenced in Star Wars: The Force Awakens. He is also an important character in the Star Wars expanded universe of television series, video games, novels, literature and comic books. Originally a Jedi prophesied to bring balance to the Force, he falls to the dark side of the Force and serves the evil Galactic Empire at the right hand of his Sith master, Emperor Palpatine (also known as Darth Sidious). He is also the father of Luke Skywalker and Princess Leia Organa, grandfather of Kylo Ren, and secret husband of Padmé Amidala. Darth Vader has become one of the most iconic villains in popular culture, and has been listed among the greatest villains and fictional characters ever.The American Film Institute listed him as the third greatest movie villain in cinema history on 100 Years... 100 Heroes and Villains, behind Hannibal Lecter and Norman Bates. However, other critics consider him a tragic hero, citing his original motivations for the greater good before his fall to the dark side.",
    "portraitID": "DarthVader"
  },
  {
    "name": "Leia Organa",
    "description": "Princess Leia Organa of Alderaan, later known as General Leia Organa, is a fictional character in the Star Wars franchise, portrayed in films by Carrie Fisher. Introduced in the original Star Wars film in 1977, Leia is princess of the planet Alderaan, a member of the Imperial Senate and an agent of the Rebel Alliance. She thwarts the sinister Sith Lord Darth Vader and helps bring about the destruction of the Empire's cataclysmic superweapon, the Death Star. In The Empire Strikes Back (1980), Leia commands a Rebel base and evades Vader as she falls in love with the smuggler, Han Solo. In Return of the Jedi (1983), Leia leads the operation to rescue Han from the crime lord Jabba the Hutt, and is revealed to be Vader's daughter and the twin sister of Luke Skywalker. The prequel film Revenge of the Sith (2005) establishes that the twins' mother is Senator (and former queen) Padmé Amidala of Naboo, who dies after childbirth. Leia is adopted by Senator Bail and Queen Breha Organa of Alderaan. In The Force Awakens (2015), Leia is the founder and General of the Resistance against the First Order and has a son with Han named Ben, who goes by the name Kylo Ren.",
    "portraitID": "Leia"
  },
  {
    "name": "Rey (?)",
    "description": "Rey is a fictional character in the Star Wars franchise, portrayed by English actress Daisy Ridley. First appearing as the central character in Star Wars: The Force Awakens,[1][6][7] Rey is a scavenger who was left behind on the planet Jakku when she was a child, and later becomes involved with the Resistance's conflict with the First Order when her solitary life is interrupted by BB-8, the droid of ace Resistance pilot Poe Dameron, and a runaway Stormtrooper named Finn.",
    "portraitID": "Rey"
  }
]